app/Controllers/admin/Dashboard.php

SELECT `pesanan`.*, `rute`.`tujuan` AS `tujuan`, `mobil`.`nama_mobil` AS `mobil`
FROM `pesanan`
JOIN `rute` ON `rute`.`id_rute` = `pesanan`.`id_rute`
JOIN `mobil` ON `mobil`.`mobil_id` = `pesanan`.`mobil_id`
WHERE `pesanan`.`tanggal` = '2025-12-21'
SELECT COUNT(*) AS `numrows`
FROM `mobil`
SELECT COUNT(*) AS `numrows`
FROM `rute`
SELECT COUNT(*) AS `numrows`
FROM `pesanan`
---
    public function index()
    {
        $mobil = new MobilModel();
        $rute = new RuteModel();
        $pesanan = new PesananModel();
        $slider = new SliderModel();
        $today = date('Y-m-d');

    $pesanan_hari_ini = $pesanan
        ->select('pesanan.*, rute.tujuan AS tujuan, mobil.nama_mobil AS mobil')
        ->join('rute', 'rute.id_rute = pesanan.id_rute')
        ->join('mobil', 'mobil.mobil_id = pesanan.mobil_id')
        ->where('pesanan.tanggal', $today)
        ->findAll();

    $data = [
        'total_mobil'        => $mobil->countAllResults(),
        'total_rute'         => $rute->countAllResults(),
        'total_pesanan'      => $pesanan->countAllResults(),
        'pesanan_bulan'      => $pesanan->PesananBulan(),
        'slider'             => $slider->findAll(),
        'pesanan_hari_ini'   => $pesanan_hari_ini
    ];

SELECT *
FROM `users`
---
    public function dataUser()
    {
        $userModel = new UserModel();
        $users = $userModel->findAll();