app/Models/PesananModel.php

SELECT COUNT(*) AS `numrows`
FROM `pesanan`
WHERE MONTH(tanggal) = '12'
AND YEAR(tanggal) = '2025'
---
    public function PesananBulan()
    {
    $bulan = date('m');
    $tahun = date('Y');

    return $this->where('MONTH(tanggal)', $bulan)
                ->where('YEAR(tanggal)', $tahun)
                ->countAllResults();